app/controllers/api/appointments_controller.rb

SELECT  "time_slots".* FROM "time_slots" WHERE "time_slots"."id" NOT IN (SELECT "appointments"."time_slot_id" FROM "appointments") AND "time_slots"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "appointments" ("doctor_id", "patient_id", "created_at", "updated_at", "time_slot_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["doctor_id", "2"], ["patient_id", 3], ["created_at", "2024-10-08 05:49:02.463925"], ["updated_at", "2024-10-08 05:49:02.463925"], ["time_slot_id", 4], ["user_id", 3]]
---
    def create
      return unauthorized_response unless current_user.has_role?(:patient)

      time_slot = TimeSlot.available.find_by(id: params[:time_slot_id])

      if time_slot && time_slot.start_time > Time.current
        appointment = current_user.appointments.new(
          time_slot: time_slot,
          doctor_id: time_slot.doctor_id,
          patient_id: current_user.id
        )

        if time_slot_within_doctor_slots?(time_slot) && appointment.valid?
          appointment.save

SELECT  1 AS one FROM "time_slots" WHERE "time_slots"."doctor_id" = $1 AND "time_slots"."id" = $2 LIMIT $3  [["doctor_id", 2], ["id", 4], ["LIMIT", 1]]
---
    def time_slot_within_doctor_slots?(time_slot)
      if time_slot.doctor.time_slots.exists?(id: time_slot.id)