app/controllers/api/time_slots_controller.rb

SELECT "users".* FROM "users" INNER JOIN "time_slots" ON "time_slots"."doctor_id" = "users"."id" INNER JOIN users_roles ON users_roles.user_id = users.id INNER JOIN roles ON roles.id = users_roles.role_id WHERE "roles"."name" = $1  [["name", "doctor"]]
SELECT "time_slots".* FROM "time_slots" WHERE "time_slots"."doctor_id" = $1 AND (for_date >= '2024-10-07')  [["doctor_id", 2]]
SELECT "time_slots".* FROM "time_slots" WHERE "time_slots"."doctor_id" = $1 AND (for_date >= '2024-10-08')  [["doctor_id", 2]]
SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1 AND (((roles.name = 'doctor') AND (roles.resource_type IS NULL) AND (roles.resource_id IS NULL)))  [["user_id", 2]]
---
    def index
      doctors = User.joins(:time_slots)
                    .joins("INNER JOIN users_roles ON users_roles.user_id = users.id")
                    .joins("INNER JOIN roles ON roles.id = users_roles.role_id")
                    .where(roles: { name: "doctor" })

      # If a query for doctor's name is provided, filter the doctors
      if params[:query].present?
        doctors = doctors.where("users.first_name ILIKE :query OR users.last_name ILIKE :query", query: "%#{params[:query]}%")
      end

      available_slots = doctors.map { |doctor| doctor_time_slot(doctor) }

INSERT INTO "time_slots" ("for_date", "start_time", "end_time", "doctor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      return unauthorized_response unless current_user.has_role?(:doctor)
      time_slot = current_user.time_slots.new(time_slot_params)

      if time_slot.save

SELECT  "time_slots".* FROM "time_slots" WHERE "time_slots"."doctor_id" = $1 AND (for_date >= '2024-10-08') ORDER BY "time_slots"."start_time" ASC LIMIT $2  [["doctor_id", 2], ["LIMIT", 1]]
---
    def doctor_time_slot(doctor)
      {
        doctor_name: "#{doctor.first_name} #{doctor.last_name}",
        slots: doctor.time_slots.where("for_date >= ?", Date.today),
        next_available_slot: doctor.time_slots.where("for_date >= ?", Date.today).order(:start_time).first