app/controllers/application_controller.rb

	def authenticated_user!
    auth_header = request.headers["HTTP_AUTHORIZATION"]

    if auth_header.present?
      token = auth_header.split(" ").last
      device_detail = DeviceDetail.find_by(authentication_token: token)

      if device_detail.present?
---
SELECT  "device_details".* FROM "device_details" WHERE "device_details"."authentication_token" = $1 LIMIT $2