app/models/time_slot.rb

  def validates_availabilty
    conflicting_slots = doctor.time_slots.where(for_date: for_date)
                                       .where.not(id: id)
                                       .where("start_time < ? AND end_time > ?", end_time, start_time)

    if conflicting_slots.exists?
---
SELECT  1 AS one FROM "time_slots" WHERE "time_slots"."doctor_id" = $1 AND "time_slots"."for_date" = $2 AND "time_slots"."id" IS NOT NULL AND (start_time < '2024-10-08 18:00:00' AND end_time > '2024-10-08 17:00:00') LIMIT $3  [["doctor_id", 2], ["for_date", "2024-10-09"], ["LIMIT", 1]]